#+OPTIONS: toc:nil

* Number letter count

** Task

If the numbers 1 to 5 are written out in words: one, two, three, four, five,
then there are 3 + 3 + 5 + 4 + 4 = 19 letters used in total.

If all the numbers from 1 to 1000 (one thousand) inclusive were written out in
words, how many letters would be used?


NOTE: Do not count spaces or hyphens. For example, 342 (three hundred and
forty-two) contains 23 letters and 115 (one hundred and fifteen) contains 20
letters. The use of "and" when writing out numbers is in compliance with British
usage.

** Solution

#+BEGIN_SRC python :results output :exports both
import math

cardinals = {
    0: "zero",
    1: "one",
    2: "two",
    3: "three",
    4: "four",
    5: "five",
    6: "six",
    7: "seven",
    8: "eight",
    9: "nine",
    10: "ten",
    11: "eleven",
    12: "twelve",
    13: "thirteen",
    14: "fourteen",
    15: "fifteen",
    16: "sixteen",
    17: "seventeen",
    18: "eighteen",
    19: "nineteen",
    20: "twenty",
    30: "thirty",
    40: "forty",
    50: "fifty",
    60: "sixty",
    70: "seventy",
    80: "eighty",
    90: "ninety",
    1000: "one thousand"
}

def get_length(string):
    string = string.replace(" ", "")
    string = string.replace("-", "")
    return len(string)

def get_words(n):
    if n in cardinals:
        return cardinals[n]

    acc = ""
    if n > 20 and n < 100:
        tens = math.floor(n / 10)
        acc += cardinals[tens * 10]
        acc += "-"
        acc += get_words(n - tens * 10)
        return acc

    if n >= 100 and n < 1000:
        hundreds = math.floor(n / 100)
        acc += cardinals[hundreds] + " hundred"
        if n / 100 == hundreds:
            return acc
        else:
            return acc + " and " + get_words(n - hundreds * 100)


total = 0
for i in range(1, 1001):
    #print(get_words(i))
    total += get_length(get_words(i))
print(total)
#+END_SRC

#+RESULTS:
: 21124
